Tekla Open API Reference for Tekla Structures 2025
Angle.ToString Method
 Converts the represented angle to a string in the current units
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
This angle as a string
See Also
Reference
Angle Class
ToString Overload
Tekla.Structures.Datatype Namespace